In [43]:
import pandas as pd
import numpy as np

In [3]:
y=pd.Period('2024')

In [4]:
y

Period('2024', 'A-DEC')

In [15]:
dir(y)

['__add__',
 '__array_priority__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_add_offset',
 '_add_timedeltalike_scalar',
 '_dtype',
 '_from_ordinal',
 '_maybe_convert_freq',
 '_require_matching_freq',
 'asfreq',
 'day',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'end_time',
 'freq',
 'freqstr',
 'hour',
 'is_leap_year',
 'minute',
 'month',
 'now',
 'ordinal',
 'quarter',
 'qyear',
 'second',
 'start_time',
 'strftime',
 'to_timestamp',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [9]:
y.end_time

Timestamp('2024-12-31 23:59:59.999999999')

In [10]:
y.is_leap_year

True

In [35]:
y2=pd.Period('2024', freq='A-FEB')
print(y2)
print(y2.start_time)
print(y2.end_time)

2024
2023-03-01 00:00:00
2024-02-29 23:59:59.999999999

In [11]:
m=pd.Period('2024-03')

In [12]:
m

Period('2024-03', 'M')

In [13]:
m.start_time

Timestamp('2024-03-01 00:00:00')

In [14]:
m.end_time

Timestamp('2024-03-31 23:59:59.999999999')

In [16]:
m+1

Period('2024-04', 'M')

In [17]:
m-1

Period('2024-02', 'M')

In [18]:
m=m+1

In [19]:
m

Period('2024-04', 'M')

In [21]:
h=pd.Period('2024-03-12 12:00:00' , freq='H')

In [22]:
h.start_time

Timestamp('2024-03-12 12:00:00')

In [23]:
h.end_time

Timestamp('2024-03-12 12:59:59.999999999')

In [36]:
q=pd.Period('2024Q1')
q

Period('2024Q1', 'Q-DEC')

In [33]:
print(q)
print(q.start_time)
print(q.end_time)

2024Q1
2024-01-01 00:00:00
2024-03-31 23:59:59.999999999

In [26]:
q+1

Period('2024Q2', 'Q-DEC')

In [30]:
q_forwalmart= pd.Period('2025Q1', freq='Q-JAN')

In [31]:
print(q_forwalmart)
print(q_forwalmart.start_time)
print(q_forwalmart.end_time)

2025Q1
2024-02-01 00:00:00
2024-04-30 23:59:59.999999999

In [42]:
#PeriodIndex

rng= pd.period_range('2020', '2024', freq='Q')
rng

PeriodIndex(['2020Q1', '2020Q2', '2020Q3', '2020Q4', '2021Q1', '2021Q2',
             '2021Q3', '2021Q4', '2022Q1', '2022Q2', '2022Q3', '2022Q4',
             '2023Q1', '2023Q2', '2023Q3', '2023Q4', '2024Q1'],
            dtype='period[Q-DEC]')

In [45]:
# create pandas series of PeriodIndex

ps=pd.Series(np.random.randint(1, 20,len(rng)), rng)
ps

2020Q1    19
2020Q2    15
2020Q3     5
2020Q4    12
2021Q1    16
2021Q2    15
2021Q3    19
2021Q4    11
2022Q1     7
2022Q2     2
2022Q3     5
2022Q4    12
2023Q1     1
2023Q2    15
2023Q3     5
2023Q4    14
2024Q1    14
Freq: Q-DEC, dtype: int32

In [46]:
ps['2020']

2020Q1    19
2020Q2    15
2020Q3     5
2020Q4    12
Freq: Q-DEC, dtype: int32

In [47]:
ps['2024']

2024Q1    14
Freq: Q-DEC, dtype: int32

In [50]:
#to convert periodindex to datetime index

datetime_ps=ps.to_timestamp()
datetime_ps

2020-01-01    19
2020-04-01    15
2020-07-01     5
2020-10-01    12
2021-01-01    16
2021-04-01    15
2021-07-01    19
2021-10-01    11
2022-01-01     7
2022-04-01     2
2022-07-01     5
2022-10-01    12
2023-01-01     1
2023-04-01    15
2023-07-01     5
2023-10-01    14
2024-01-01    14
Freq: QS-OCT, dtype: int32

In [52]:
#convert datetime index to period index
datetime_ps.index.to_period()

PeriodIndex(['2020Q1', '2020Q2', '2020Q3', '2020Q4', '2021Q1', '2021Q2',
             '2021Q3', '2021Q4', '2022Q1', '2022Q2', '2022Q3', '2022Q4',
             '2023Q1', '2023Q2', '2023Q3', '2023Q4', '2024Q1'],
            dtype='period[Q-DEC]')

In [71]:
# for dataframe
df= pd.read_csv('C:/Users/Vansh Bansal/Downloads/wmt.csv')
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [72]:
df.columns

Index(['Line Item', '2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [74]:
df.set_index('Line Item', inplace = True)

KeyError: "None of ['Line Item'] are in the columns"

In [75]:
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [78]:
df1=df.T
df1

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [79]:
df=df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [82]:
df.index

Index(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [89]:
df.index=pd.PeriodIndex(df.index)
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-DEC]')

In [87]:
df['start_date']= df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit start_date
2017Q1      115904     86544   29360 2017-01-01
2017Q2      120854     89485   31369 2017-04-01
2017Q3      118179     87484   30695 2017-07-01
2017Q4      130936     97743   33193 2017-10-01
2018Q1      117542     87688   29854 2018-01-01

In [88]:
df['end_date']= df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit start_date                      end_date
2017Q1      115904     86544   29360 2017-01-01 2017-03-31 23:59:59.999999999
2017Q2      120854     89485   31369 2017-04-01 2017-06-30 23:59:59.999999999
2017Q3      118179     87484   30695 2017-07-01 2017-09-30 23:59:59.999999999
2017Q4      130936     97743   33193 2017-10-01 2017-12-31 23:59:59.999999999
2018Q1      117542     87688   29854 2018-01-01 2018-03-31 23:59:59.999999999